literate-programs/11-20-Introductory-metaprogramming.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-23 Mon 12:31 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Introductory metaprogramming</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mark Armstrong" />
<meta name="description" content="A very introductory look at metaprogramming."
 />
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Introductory metaprogramming</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#Metaprogramming">1. Metaprogramming</a></li>
<li><a href="#Disclosure">2. Disclosure</a></li>
<li><a href="#Ruby">3. Ruby</a></li>
<li><a href="#Clojure">4. Clojure</a></li>
</ul>
</div>
</div>

<div id="outline-container-Metaprogramming" class="outline-2">
<h2 id="Metaprogramming"><span class="section-number-2">1</span> Metaprogramming</h2>
<div class="outline-text-2" id="text-Metaprogramming">
<p>
Metaprogramming, as the name implies,
regards programs <i>that are constructed dynamically</i>,
that is, programs whose construction is (at least partially)
carried out at runtime.
</p>
</div>
</div>

<div id="outline-container-Disclosure" class="outline-2">
<h2 id="Disclosure"><span class="section-number-2">2</span> Disclosure</h2>
<div class="outline-text-2" id="text-Disclosure">
<p>
I am not an expert on metaprogramming; far from it.
</p>

<p>
This material is intended as a <i>very introductory</i> taste of what
metaprogramming offers.
</p>

<p>
It is <i>not</i> intended to show particularly <i>good</i> uses of metaprogramming.
In particular, the Ruby examples might be somewhat dangerous and
ill-advised (the Clojure examples should be a little higher in quality.)
</p>
</div>
</div>

<div id="outline-container-Ruby" class="outline-2">
<h2 id="Ruby"><span class="section-number-2">3</span> Ruby</h2>
<div class="outline-text-2" id="text-Ruby">
<p>
Suppose we want to have a way to run a piece of code on an object
twice. We can do this for a particular class fairly easily.
</p>

<p>
As a first attempt:
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">MyClass</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">to_s</span>
    <span style="color: #79a8ff;">"I am an object"</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">twice</span><span style="color: #00cd68;">(</span>&amp;block<span style="color: #00cd68;">)</span>
    <span style="color: #b6a0ff;">yield</span>
    <span style="color: #b6a0ff;">yield</span>
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

x = <span style="color: #6ae4b9;">MyClass</span>.new
<span style="color: #f78fe7;">puts</span> x.twice <span style="color: #00cd68;">{</span> <span style="color: #f78fe7;">puts</span> <span style="color: #b6a0ff;">self</span> <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
In this first attempt, the <code>self</code> in the block refers to <code>self</code> at the
point the block is written.
</p>

<p>
We can make use of the <code>instance_eval</code> method instead of <code>yield</code> to
run the block <i>within the method we are defining</i>.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">MyClass</span>
  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">to_s</span>
    <span style="color: #79a8ff;">"I am an object"</span>
  <span style="color: #b6a0ff;">end</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">twice</span><span style="color: #00cd68;">(</span>&amp;block<span style="color: #00cd68;">)</span>
    instance_eval &amp;block
    instance_eval &amp;block
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

x = <span style="color: #6ae4b9;">MyClass</span>.new
<span style="color: #f78fe7;">puts</span> x.twice <span style="color: #00cd68;">{</span> <span style="color: #f78fe7;">puts</span> <span style="color: #b6a0ff;">self</span> <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
This is fine for this kind of object. But I can't use it more generally;
for instance, I can't do
</p>
<div class="org-src-container">
<pre class="src src-ruby">5.twice <span style="color: #00cd68;">{</span> <span style="color: #f78fe7;">puts</span> <span style="color: #b6a0ff;">self</span> <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
What I need to do is add this method to the <code>Object</code> class
that all other classes inherit from.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Object</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">twice</span><span style="color: #00cd68;">(</span>&amp;block<span style="color: #00cd68;">)</span>
    instance_eval &amp;block
    instance_eval &amp;block
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

5.twice <span style="color: #00cd68;">{</span> <span style="color: #f78fe7;">puts</span> <span style="color: #b6a0ff;">self</span> <span style="color: #00cd68;">}</span>
</pre>
</div>

<p>
We can go further. For instance, we can modify how Ruby responds
if we call a method that does not exist for a given object.
</p>
<div class="org-src-container">
<pre class="src src-ruby"><span style="color: #b6a0ff;">class</span> <span style="color: #6ae4b9;">Object</span>

  <span style="color: #b6a0ff;">def</span> <span style="color: #feacd0;">method_missing</span><span style="color: #00cd68;">(</span>method_name, *args, &amp;block<span style="color: #00cd68;">)</span>
    <span style="color: #f78fe7;">print</span> <span style="color: #79a8ff;">"Uh-oh; I couldn't find the "</span>
    <span style="color: #f78fe7;">print</span> method_name
    <span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">" method!"</span>
    <span style="color: #b6a0ff;">return</span> <span style="color: #00bcff;">nil</span>
  <span style="color: #b6a0ff;">end</span>
<span style="color: #b6a0ff;">end</span>

5.do_something
<span style="color: #f78fe7;">puts</span> <span style="color: #79a8ff;">"Look ma, I didn't crash!"</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-Clojure" class="outline-2">
<h2 id="Clojure"><span class="section-number-2">4</span> Clojure</h2>
<div class="outline-text-2" id="text-Clojure">
<p>
In Clojure, we can use <i>macros</i> to perform metaprogramming.
</p>

<p>
For instance, we might miss the <code>unless</code> construct which is
present in many languages, but not in Clojure.
We could try to define it as a function:
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">defn</span> <span style="color: #feacd0;">unless</span> <span style="color: #b6a0ff;">[</span>test then else<span style="color: #b6a0ff;">]</span>
  <span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">if</span> test
    else
    then<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #00cd68;">(</span>unless <span style="color: #b6a0ff;">(</span>= 0 0<span style="color: #b6a0ff;">)</span>
        <span style="color: #b6a0ff;">(</span>println <span style="color: #79a8ff;">"Equality is broken!"</span><span style="color: #b6a0ff;">)</span>
        <span style="color: #b6a0ff;">(</span>println <span style="color: #79a8ff;">"Nevermind, it's okay."</span><span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>

<p>
We can specify the behaviour of <code>unless</code> more precisely with a macro.
</p>
<div class="org-src-container">
<pre class="src src-clojure"><span style="color: #00cd68;">(</span><span style="color: #b6a0ff;">defmacro</span> <span style="color: #feacd0;">unless</span> <span style="color: #b6a0ff;">[</span>test then else<span style="color: #b6a0ff;">]</span>
  `<span style="color: #b6a0ff;">(</span><span style="color: #b6a0ff;">if</span> ~test
     ~else
     ~then<span style="color: #b6a0ff;">)</span><span style="color: #00cd68;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mark Armstrong</p>
     <p class="author">Contact: <a href="mailto:markparmstrong@gmail.com">markparmstrong@gmail.com</a></p>
     <p class="date">Original date: </p>
     <p class="date">Last updated: 2020-11-23 Mon 12:31</p>
     <p class="creator">Created using <a href="https://www.gnu.org/software/emacs/">Emacs</a> 27.0.90 (<a href="https://orgmode.org">Org</a> mode 9.4)</p>
     <p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
